eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_565rgb.c
    /* the pixelmap is raw, use ChromeArt */
    GX_RECTANGLE *clip = context -> gx_draw_context_clip;
    canvas = context->gx_draw_context_canvas;

    putrow = (USHORT *)context -> gx_draw_context_memory;
    putrow += clip -> gx_rectangle_top * context->gx_draw_context_pitch;
    putrow += clip -> gx_rectangle_left;

    if (pixelmap->gx_pixelmap_format == GX_COLOR_FORMAT_565RGB)
    {
        getshort = (USHORT *)(pixelmap -> gx_pixelmap_data);
        getshort += pixelmap -> gx_pixelmap_width * (clip -> gx_rectangle_top - ypos);
        getshort += (clip -> gx_rectangle_left - xpos);
    }
    else
    {
        getlong = (ULONG *)(pixelmap -> gx_pixelmap_data);
        getlong += pixelmap -> gx_pixelmap_width * (clip -> gx_rectangle_top - ypos);
        getlong += (clip -> gx_rectangle_left - xpos);
    }

    width = clip->gx_rectangle_right - clip -> gx_rectangle_left + 1;
    height = clip->gx_rectangle_bottom - clip->gx_rectangle_top + 1;

    gx_dma_init(DMA2D_M2M_BLEND, (uint32_t) putrow, canvas->gx_canvas_x_resolution - width, width, height);  

    blend_reg = alpha;
    blend_reg <<= 24;

    if (pixelmap->gx_pixelmap_format == GX_COLOR_FORMAT_565RGB)
    {
        DMA2D->FGMAR = (uint32_t) getshort;             // foreground memory address
        blend_reg |= DMA2D_RGB565;
    }
    else
    {
        DMA2D->FGMAR = (uint32_t) getlong;             // foreground memory address
        blend_reg |= DMA2D_ARGB8888;
    }

    if (pixelmap->gx_pixelmap_flags & GX_PIXELMAP_ALPHA)
    {
        // blend original alpha with alpha
        blend_reg |= 0x00020000;
    }
    else
    {
        // replace alpha
        blend_reg |= 0x00010000;
    }
    DMA2D->FGPFCCR = blend_reg;  // foreground format conversion
    DMA2D->FGOR = pixelmap->gx_pixelmap_width - width;  // foreground offset

    DMA2D->BGMAR = (uint32_t) putrow;          // background memory address
    DMA2D->BGOR = canvas->gx_canvas_x_resolution - width;  // background offset
    DMA2D->BGPFCCR = 0xff010002;

    gx_dma_run();
}

/**************************************************************************/
/*  gx_chromeart_glyph_8bit_draw                                          */ 
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void gx_chromeart_glyph_8bit_draw(GX_DRAW_CONTEXT *context, GX_RECTANGLE *draw_area,
        GX_POINT *map_offset, const GX_GLYPH *glyph)
{
GX_CANVAS  *canvas;
GX_UBYTE   *read_glyph;
USHORT     *write_row;
GX_COLOR    text_color;
UINT        height;
UINT        width;
UCHAR       red, green, blue;
GX_UBYTE    alpha;
ULONG    pfc_reg;

    text_color =  context -> gx_draw_context_brush.gx_brush_line_color;

    alpha = context ->gx_draw_context_brush.gx_brush_alpha;

    if (alpha == 0)
    {
        return;
    }

    red = (text_color & 0xf800) >> 8;
    green = (text_color & 0x07e0) >> 3;
    blue = (text_color & 0x001f) << 3;
    text_color = (red << 16) | (green << 8) | blue;
    width = draw_area -> gx_rectangle_right - draw_area -> gx_rectangle_left + 1;

    /* pickup pointer to current display driver */
    canvas = context->gx_draw_context_canvas;

    read_glyph = (GX_UBYTE *)glyph -> gx_glyph_map;

    if (map_offset -> gx_point_y)
    {
        read_glyph = read_glyph + (glyph -> gx_glyph_width * map_offset -> gx_point_y);
    }

    read_glyph += map_offset -> gx_point_x;

    width = draw_area->gx_rectangle_right - draw_area->gx_rectangle_left + 1;
    height = draw_area -> gx_rectangle_bottom - draw_area -> gx_rectangle_top + 1;

    write_row = (USHORT *) canvas->gx_canvas_memory;
    write_row += draw_area->gx_rectangle_top * context->gx_draw_context_pitch;
    write_row += draw_area->gx_rectangle_left;
  
    gx_dma_init(DMA2D_M2M_BLEND, (uint32_t) write_row, canvas->gx_canvas_x_resolution - width, width, height);  

    DMA2D->FGMAR = (uint32_t) read_glyph;           // foreground memory address
    DMA2D->FGOR = glyph->gx_glyph_width - width;  // foreground offset
    pfc_reg = alpha;
    pfc_reg <<= 24;
    pfc_reg |= 0x00020009;

    DMA2D->FGPFCCR = pfc_reg;   
    DMA2D->FGCOLR = text_color;

    DMA2D->BGMAR = (uint32_t) write_row;          // background memory address
    DMA2D->BGOR = canvas->gx_canvas_x_resolution - width;  // background offset
    DMA2D->BGPFCCR = 0xff000002;

    gx_dma_run();
}

#if defined(GX_TIMING_ENABLE)
/**************************************************************************/
/*  gx_chromeart_drawing_initiate                                         */ 
/*    Override generic function to toggle I/O to allow precise timing     */
/*    measurement.                                                        */
/**************************************************************************/
static VOID gx_chromeart_drawing_initiate(GX_DISPLAY *display, GX_CANVAS *canvas)
{
    TIMING_FRAME_CALC_BEGIN
    TIMING_CPU_WORK_BEGIN
}

/**************************************************************************/
/*  gx_chromeart_drawing_complete                                         */ 
/*    Override generic function to toggle I/O to allow precise timing     */
/*    measurement.                                                        */
/**************************************************************************/
static VOID gx_chromeart_drawing_complete(GX_DISPLAY *display, GX_CANVAS *canvas)
{
    TIMING_FRAME_CALC_END
    TIMING_CPU_WORK_END
}
#endif

/**************************************************************************/
/*  stm32f429_24xrgb_buffer_toggle                                        */ 
/*    Override generic function to utilize DMA2D                          */
/**************************************************************************/
static void stm32f429_565rgb_buffer_toggle(GX_CANVAS *canvas, GX_RECTANGLE *dirty)
{
GX_RECTANGLE    Limit;
GX_RECTANGLE    Copy;
ULONG           offset;
INT             copy_width;
INT             copy_height;

#if !defined(GX_CHROMEART_ENABLE)
INT             row;
INT             src_stride_ulongs;
INT             dest_stride_ulongs;
#endif

ULONG *get;
ULONG *put;
#ifdef GX_PING_PONG_FRAME_BUFFERS
USHORT *temp;

    frame_buffer_toggle_start = GX_TRUE;

    /* Set frame buffer start address. */
    LTDC_Layer1 -> CFBAR = (uint32_t)canvas->gx_canvas_memory;
    LTDC->SRCR = LTDC_SRCR_VBR;

    /* Wait for register reload interrupt. */
    tx_semaphore_get(&register_reload_semaphore, TX_WAIT_FOREVER);
#endif
    
#ifdef GX_FRAME_RATE_TEST_ENABLE
    frame_rate++;
#endif
        
    gx_utility_rectangle_define(&Limit, 0, 0,
                                canvas->gx_canvas_x_resolution - 1,
                                canvas->gx_canvas_y_resolution - 1);

    if (gx_utility_rectangle_overlap_detect(&Limit, &canvas->gx_canvas_dirty_area, &Copy))
    {
        Copy.gx_rectangle_left &= 0xfffe;
        Copy.gx_rectangle_right |= 0x01;
        copy_width = Copy.gx_rectangle_right - Copy.gx_rectangle_left + 1;

        copy_height = Copy.gx_rectangle_bottom - Copy.gx_rectangle_top + 1;

        offset = Copy.gx_rectangle_top * canvas->gx_canvas_x_resolution;
        offset += Copy.gx_rectangle_left;
        offset /= 2;        // in ulongs
        get = canvas ->gx_canvas_memory;
        get += offset;

        // offset by dirty rect pos
        put = (ULONG *) visible_frame_buffer;
            
        // offset by canvas offset:
        offset = (canvas->gx_canvas_display_offset_y + Copy.gx_rectangle_top)* STM32F429_DISCO_SCREEN_WIDTH;
        offset += canvas->gx_canvas_display_offset_x + Copy.gx_rectangle_left;
        offset /= 2;
        put += offset;
        

#if defined(GX_CHROMEART_ENABLE)
        gx_dma_init(DMA2D_M2M, (uint32_t) put, STM32F429_DISCO_SCREEN_WIDTH - copy_width, copy_width, copy_height);  

        DMA2D->FGPFCCR = (0xff000000) | DMA2D_RGB565;  // foreground format conversion
        DMA2D->FGMAR = (uint32_t) get;            // foreground memory address
        DMA2D->FGOR = canvas->gx_canvas_x_resolution - copy_width;  // foreground offset
        gx_dma_run();
        
#else
        src_stride_ulongs = canvas ->gx_canvas_x_resolution / 2;
        dest_stride_ulongs = STM32F429_DISCO_SCREEN_WIDTH / 2;
        copy_width /= 2;     // in ulongs

        for(row = 0; row < copy_height; row++)
        {
            memcpy(put, get, copy_width * 4); /* Use case of memcpy is verified. */
            put += dest_stride_ulongs;
            get += src_stride_ulongs;
        }
#endif
        
